# 10 Minutes to pandas


http://pandas.pydata.org/pandas-docs/stable/10min.html

This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the Cookbook
Customarily, we import as follows:

这是针对PYTHON新手设计的PANDAS库介绍，你能看到一些较为复杂的处理，我们先按照下面进行引入：

In [6]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

# 1、Object Creation（创建对象）

See the Data Structure Intro section
Creating a Series by passing a list of values, letting pandas create a default integer index:
可以通过传递一个list对象来创建一个Series，pandas会默认创建整型索引：

In [7]:
s = pd.Series([1,3,5,np.nan,6,8])

In [8]:
s  # 一维数组包含索引

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:
通过传递一个numpy array，时间索引以及列标签来创建一个DataFrame：

In [11]:
dates = pd.date_range('20130101', periods=6)

In [12]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [1]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

NameError: name 'pd' is not defined

In [2]:
df

NameError: name 'df' is not defined

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [15]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [16]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [17]:
df2.dtypes                 #Having specific dtypes查看数据类型

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

In [ ]:
#df2. Tab

# 2.Viewing Data   查看数据

See the top & bottom rows of the frame 查看顶部与底部的值

In [18]:
df.head()

                   A         B         C         D
2013-01-01  0.572041 -0.727444 -0.962632 -0.725688
2013-01-02  0.356664 -0.421598  0.142940 -0.375914
2013-01-03  0.057986  0.080648  2.295449 -0.671532
2013-01-04  1.146592  0.261133  0.029271 -0.843957
2013-01-05 -0.244880 -1.621350 -0.411883  0.897634

In [19]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.146592  0.261133  0.029271 -0.843957
2013-01-05 -0.244880 -1.621350 -0.411883  0.897634
2013-01-06 -2.186056 -0.242099 -0.562573 -1.019132

Display the index, columns, and the underlying numpy data
显示INDEX（索引），columns（字段），和底层NUMPY数据

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df.values

array([[ 0.57204074, -0.72744382, -0.96263243, -0.7256876 ],
       [ 0.35666351, -0.42159805,  0.14294006, -0.37591352],
       [ 0.0579864 ,  0.080648  ,  2.29544918, -0.67153235],
       [ 1.14659228,  0.26113337,  0.0292706 , -0.8439573 ],
       [-0.24488018, -1.62135016, -0.41188321,  0.89763429],
       [-2.18605551, -0.24209909, -0.56257276, -1.01913249]])

Describe shows a quick statistic summary of your data
显示快速统计

In [23]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.049609 -0.445118  0.088429 -0.456431
std    1.148609  0.675310  1.153799  0.696499
min   -2.186056 -1.621350 -0.962632 -1.019132
25%   -0.169164 -0.650982 -0.524900 -0.814390
50%    0.207325 -0.331849 -0.191306 -0.698610
75%    0.518196 -0.000039  0.114523 -0.449818
max    1.146592  0.261133  2.295449  0.897634

Transposing your data 转置

In [24]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.572041    0.356664    0.057986    1.146592   -0.244880   -2.186056
B   -0.727444   -0.421598    0.080648    0.261133   -1.621350   -0.242099
C   -0.962632    0.142940    2.295449    0.029271   -0.411883   -0.562573
D   -0.725688   -0.375914   -0.671532   -0.843957    0.897634   -1.019132

Sorting by an axis按轴进行排序

In [25]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.725688 -0.962632 -0.727444  0.572041
2013-01-02 -0.375914  0.142940 -0.421598  0.356664
2013-01-03 -0.671532  2.295449  0.080648  0.057986
2013-01-04 -0.843957  0.029271  0.261133  1.146592
2013-01-05  0.897634 -0.411883 -1.621350 -0.244880
2013-01-06 -1.019132 -0.562573 -0.242099 -2.186056

In [26]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-04  1.146592  0.261133  0.029271 -0.843957
2013-01-03  0.057986  0.080648  2.295449 -0.671532
2013-01-06 -2.186056 -0.242099 -0.562573 -1.019132
2013-01-02  0.356664 -0.421598  0.142940 -0.375914
2013-01-01  0.572041 -0.727444 -0.962632 -0.725688
2013-01-05 -0.244880 -1.621350 -0.411883  0.897634

# 3.Selection 选择

Note While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

虽然标准的Python/Numpy的选择和设置表达式都能够直接派上用场，但是作为工程使用的代码，我们推荐使用经过优化的pandas数据访问方式： .at, .iat, .loc, .iloc 和 .ix详情请参阅Indexing and Selecing Data 和 MultiIndex / Advanced Indexing。

## 3.1 getting 获取

Selecting a single column, which yields a Series, equivalent to df.A
选取'A'列

In [27]:
df['A']

2013-01-01    0.572041
2013-01-02    0.356664
2013-01-03    0.057986
2013-01-04    1.146592
2013-01-05   -0.244880
2013-01-06   -2.186056
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows. 通过[]进行选择，这将会对行进行切片

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01  0.572041 -0.727444 -0.962632 -0.725688
2013-01-02  0.356664 -0.421598  0.142940 -0.375914
2013-01-03  0.057986  0.080648  2.295449 -0.671532

In [29]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.356664 -0.421598  0.142940 -0.375914
2013-01-03  0.057986  0.080648  2.295449 -0.671532
2013-01-04  1.146592  0.261133  0.029271 -0.843957

## 3.2 Selection by Label 通过标签选择

See more in Selection by Label
For getting a cross section using a label
使用标签来获取一个交叉的区域

In [30]:
df.loc[dates[0]]

A    0.572041
B   -0.727444
C   -0.962632
D   -0.725688
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label多标签多轴选择

In [31]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.572041 -0.727444
2013-01-02  0.356664 -0.421598
2013-01-03  0.057986  0.080648
2013-01-04  1.146592  0.261133
2013-01-05 -0.244880 -1.621350
2013-01-06 -2.186056 -0.242099

Showing label slicing, both endpoints are included
标签切片

In [32]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.356664 -0.421598
2013-01-03  0.057986  0.080648
2013-01-04  1.146592  0.261133

In [33]:
df.loc['20130102',['A','B']]

A    0.356664
B   -0.421598
Name: 2013-01-02 00:00:00, dtype: float64

In [34]:
df.loc[dates[0],'A']

0.57204074190724274

快速访问一个标量（与上一个方法等价）

In [35]:
df.at[dates[0],'A']

0.57204074190724274

## 3.3 Selection by Position通过位置获取

Select via the position of the passed integers通过传递数值进行位置选择（选择的是行）

In [36]:
df.iloc[3]

A    1.146592
B    0.261133
C    0.029271
D   -0.843957
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python
通过数值进行切片，与numpy/python中的情况类似

In [37]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.146592  0.261133
2013-01-05 -0.244880 -1.621350

By lists of integer position locations, similar to the numpy/python style
通过指定一个位置的列表，与numpy/python中的情况类似

In [38]:
df.iloc[[1,3,4],[0,2]]

                   A         C
2013-01-02  0.356664  0.142940
2013-01-04  1.146592  0.029271
2013-01-05 -0.244880 -0.411883

For slicing rows explicitly 对行进行切片

In [39]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.356664 -0.421598  0.142940 -0.375914
2013-01-03  0.057986  0.080648  2.295449 -0.671532

For slicing columns explicitly列进行切片

In [40]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.727444 -0.962632
2013-01-02 -0.421598  0.142940
2013-01-03  0.080648  2.295449
2013-01-04  0.261133  0.029271
2013-01-05 -1.621350 -0.411883
2013-01-06 -0.242099 -0.562573

For getting a value explicitly获取特定的值

In [41]:
df.iloc[1,1]

-0.42159805321901206

In [42]:
df.iat[1,1]

-0.42159805321901206

## 3.4Boolean Indexing¶  布尔索引

Using a single column’s values to select data.
使用一个单独列的值来选择数据：

In [43]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.572041 -0.727444 -0.962632 -0.725688
2013-01-02  0.356664 -0.421598  0.142940 -0.375914
2013-01-03  0.057986  0.080648  2.295449 -0.671532
2013-01-04  1.146592  0.261133  0.029271 -0.843957

Selecting values from a DataFrame where a boolean condition is met
添加WHERE条件选取数据

In [44]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.572041       NaN       NaN       NaN
2013-01-02  0.356664       NaN  0.142940       NaN
2013-01-03  0.057986  0.080648  2.295449       NaN
2013-01-04  1.146592  0.261133  0.029271       NaN
2013-01-05       NaN       NaN       NaN  0.897634
2013-01-06       NaN       NaN       NaN       NaN

Using the isin() method for filtering:

使用isin()方法来过滤：

In [45]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [46]:
df3 = df.copy()   #.copy分配内存空间，直接赋值不分配空间  df3 = df.copy()

In [47]:
df['E'] = ['one', 'one','two','three','four','three']

In [48]:
df

                   A         B         C         D      E
2013-01-01 -1.525126  0.427834 -1.116584  2.346993    one
2013-01-02 -0.314051  0.535153 -1.952636  0.888753    one
2013-01-03 -0.228564 -0.700934 -0.760419  0.106540    two
2013-01-04 -0.812964 -0.815132 -0.843754  0.555661  three
2013-01-05 -0.785754 -0.564866  0.290717  0.691717   four
2013-01-06  1.592374  0.255792 -1.024077  0.180648  three

In [49]:
df[df['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.228564 -0.700934 -0.760419  0.106540   two
2013-01-05 -0.785754 -0.564866  0.290717  0.691717  four

## 3.5 Setting设置
Setting a new column automatically aligns the data by the indexes
设置一个新的列：

In [50]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [51]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

Setting values by label

In [52]:
df

                   A         B         C         D      E
2013-01-01 -1.525126  0.427834 -1.116584  2.346993    one
2013-01-02 -0.314051  0.535153 -1.952636  0.888753    one
2013-01-03 -0.228564 -0.700934 -0.760419  0.106540    two
2013-01-04 -0.812964 -0.815132 -0.843754  0.555661  three
2013-01-05 -0.785754 -0.564866  0.290717  0.691717   four
2013-01-06  1.592374  0.255792 -1.024077  0.180648  three

In [53]:
df.at[dates[0],'A'] = 0

In [54]:
df

                   A         B         C         D      E
2013-01-01  0.000000  0.427834 -1.116584  2.346993    one
2013-01-02 -0.314051  0.535153 -1.952636  0.888753    one
2013-01-03 -0.228564 -0.700934 -0.760419  0.106540    two
2013-01-04 -0.812964 -0.815132 -0.843754  0.555661  three
2013-01-05 -0.785754 -0.564866  0.290717  0.691717   four
2013-01-06  1.592374  0.255792 -1.024077  0.180648  three

Setting values by position

In [55]:
df

                   A         B         C         D      E
2013-01-01  0.000000  0.427834 -1.116584  2.346993    one
2013-01-02 -0.314051  0.535153 -1.952636  0.888753    one
2013-01-03 -0.228564 -0.700934 -0.760419  0.106540    two
2013-01-04 -0.812964 -0.815132 -0.843754  0.555661  three
2013-01-05 -0.785754 -0.564866  0.290717  0.691717   four
2013-01-06  1.592374  0.255792 -1.024077  0.180648  three

In [56]:
df.iat[0,1] = 0

In [57]:
df

                   A         B         C         D      E
2013-01-01  0.000000  0.000000 -1.116584  2.346993    one
2013-01-02 -0.314051  0.535153 -1.952636  0.888753    one
2013-01-03 -0.228564 -0.700934 -0.760419  0.106540    two
2013-01-04 -0.812964 -0.815132 -0.843754  0.555661  three
2013-01-05 -0.785754 -0.564866  0.290717  0.691717   four
2013-01-06  1.592374  0.255792 -1.024077  0.180648  three

Setting by assigning with a numpy array

通过一个numpy数组设置一组新值：

In [58]:
df.loc[:,'D'] = np.array([5] * len(df))

In [59]:
df

                   A         B         C  D      E
2013-01-01  0.000000  0.000000 -1.116584  5    one
2013-01-02 -0.314051  0.535153 -1.952636  5    one
2013-01-03 -0.228564 -0.700934 -0.760419  5    two
2013-01-04 -0.812964 -0.815132 -0.843754  5  three
2013-01-05 -0.785754 -0.564866  0.290717  5   four
2013-01-06  1.592374  0.255792 -1.024077  5  three

A where operation with setting.
通过where操作来设置新的值：

In [60]:
df=df.drop(['D','E'],axis=1)

In [61]:
df

                   A         B         C
2013-01-01  0.000000  0.000000 -1.116584
2013-01-02 -0.314051  0.535153 -1.952636
2013-01-03 -0.228564 -0.700934 -0.760419
2013-01-04 -0.812964 -0.815132 -0.843754
2013-01-05 -0.785754 -0.564866  0.290717
2013-01-06  1.592374  0.255792 -1.024077

# 4.Missing Data 缺失值处理
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

在pandas中，使用np.nan来代替缺失值，这些值将默认不会包含在计算中，详情请参阅：Missing Data Section。

reindex()方法可以对指定轴上的索引进行改变/增加/删除操作，这将返回原始数据的一个拷贝：、

In [62]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [63]:
# df = df.drop(['E'],axis=1)

In [64]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [65]:
df1

                   A         B         C         D   E
2013-01-01 -0.783744  0.440609  0.914059  0.332451 NaN
2013-01-02  0.399308 -0.593326 -0.076293  0.557784 NaN
2013-01-03  1.545892 -0.835281 -1.687135  1.756015 NaN
2013-01-04 -1.047887  0.925753 -0.360323  0.227492 NaN

In [66]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [67]:
df1

                   A         B         C         D    E
2013-01-01 -0.783744  0.440609  0.914059  0.332451  1.0
2013-01-02  0.399308 -0.593326 -0.076293  0.557784  1.0
2013-01-03  1.545892 -0.835281 -1.687135  1.756015  NaN
2013-01-04 -1.047887  0.925753 -0.360323  0.227492  NaN

To drop any rows that have missing data.
去掉包含缺失值的行：

In [68]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01 -0.783744  0.440609  0.914059  0.332451  1.0
2013-01-02  0.399308 -0.593326 -0.076293  0.557784  1.0

Filling missing data 
对缺失值进行填充：

In [69]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -0.783744  0.440609  0.914059  0.332451  1.0
2013-01-02  0.399308 -0.593326 -0.076293  0.557784  1.0
2013-01-03  1.545892 -0.835281 -1.687135  1.756015  5.0
2013-01-04 -1.047887  0.925753 -0.360323  0.227492  5.0

To get the boolean mask where values are nan
得到布尔型数判断是否为空

In [70]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

# 5.Operations 相关操作

## 5.1 STATS统计
Operations in general exclude missing data.（相关操作通常情况下不包括缺失值）

Performing a descriptive statistic


执行描述性统计：

In [71]:
df.mean()

A    0.357174
B   -0.125592
C    0.014531
D    0.860708
dtype: float64

Same operation on the other axis
在其他轴上进行相同的操作：

In [72]:
df.mean(1)

2013-01-01    0.225844
2013-01-02    0.071868
2013-01-03    0.194873
2013-01-04   -0.063741
2013-01-05    0.473515
2013-01-06    0.757874
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.


  对于拥有不同维度，需要对齐的对象进行操作。Pandas会自动的沿着指定的维度进行广播：

In [73]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [74]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

# 5.2 Apply应用
Applying functions to the data
对数据应用函数：

In [75]:
np.cumsum

In [76]:
df

                   A         B         C         D
2013-01-01 -0.783744  0.440609  0.914059  0.332451
2013-01-02  0.399308 -0.593326 -0.076293  0.557784
2013-01-03  1.545892 -0.835281 -1.687135  1.756015
2013-01-04 -1.047887  0.925753 -0.360323  0.227492
2013-01-05  1.936546 -0.168568 -0.214547  0.340628
2013-01-06  0.092931 -0.522739  1.511422  1.949879

In [77]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.783744  0.440609  0.914059  0.332451
2013-01-02 -0.384437 -0.152717  0.837766  0.890235
2013-01-03  1.161456 -0.987998 -0.849369  2.646250
2013-01-04  0.113569 -0.062245 -1.209692  2.873742
2013-01-05  2.050115 -0.230813 -1.424238  3.214370
2013-01-06  2.143046 -0.753552  0.087184  5.164249

In [78]:
df['A'].apply(lambda x: 1 if x > 0 else 0)

2013-01-01    0
2013-01-02    1
2013-01-03    1
2013-01-04    0
2013-01-05    1
2013-01-06    1
Freq: D, Name: A, dtype: int64

# 5.3计数

In [79]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [80]:
s

0    0
1    1
2    0
3    0
4    2
5    4
6    3
7    2
8    2
9    3
dtype: int64

In [81]:
s.value_counts()

2    3
0    3
3    2
4    1
1    1
dtype: int64

## 5.4 String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them). See more at Vectorized String Methods.


Series对象在其str属性中配备了一组字符串处理方法，可以很容易的应用到数组中的每个元素，如下段代码所示。更多详情请参考：Vectorized String Methods.

In [82]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [83]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [84]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

# 6 Merge合并

## 6.1Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the Merging section

Concatenating pandas objects together with concat():



Pandas提供了大量的方法能够轻松的对Series，DataFrame和Panel对象进行各种符合各种逻辑关系的合并操作。具体请参阅：Merging section

In [85]:
df = pd.DataFrame(np.random.randn(10, 4))

In [86]:
df

          0         1         2         3
0 -0.525082  0.523438  0.074403  0.526306
1 -2.272707 -0.216516  0.515286  1.311648
2  1.054443 -0.450960  1.591322 -0.202680
3 -0.886757 -0.905608  0.837743 -1.805457
4 -0.331228  0.092742  0.386955 -0.427374
5 -1.562587  1.544625  1.159311 -0.462092
6  0.859576 -0.218776  0.957348  0.788866
7  1.489090  0.517776 -0.174220  0.909069
8 -0.624349  2.647512 -1.351698 -1.217413
9 -1.245338 -1.540711  0.396086 -0.325178

In [87]:
pieces = [df[:3], df[3:7], df[7:]]         #分为三个表

In [88]:
pieces

[          0         1         2         3
 0 -0.525082  0.523438  0.074403  0.526306
 1 -2.272707 -0.216516  0.515286  1.311648
 2  1.054443 -0.450960  1.591322 -0.202680,
           0         1         2         3
 3 -0.886757 -0.905608  0.837743 -1.805457
 4 -0.331228  0.092742  0.386955 -0.427374
 5 -1.562587  1.544625  1.159311 -0.462092
 6  0.859576 -0.218776  0.957348  0.788866,
           0         1         2         3
 7  1.489090  0.517776 -0.174220  0.909069
 8 -0.624349  2.647512 -1.351698 -1.217413
 9 -1.245338 -1.540711  0.396086 -0.325178]

In [89]:
pd.concat(pieces)

          0         1         2         3
0 -0.525082  0.523438  0.074403  0.526306
1 -2.272707 -0.216516  0.515286  1.311648
2  1.054443 -0.450960  1.591322 -0.202680
3 -0.886757 -0.905608  0.837743 -1.805457
4 -0.331228  0.092742  0.386955 -0.427374
5 -1.562587  1.544625  1.159311 -0.462092
6  0.859576 -0.218776  0.957348  0.788866
7  1.489090  0.517776 -0.174220  0.909069
8 -0.624349  2.647512 -1.351698 -1.217413
9 -1.245338 -1.540711  0.396086 -0.325178

## 6.2 join

与SQL一样，常用于关联为一张大表分析

In [90]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [91]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [92]:
left

   key  lval
0  foo     1
1  bar     2

In [93]:
right

   key  rval
0  foo     4
1  bar     5

In [94]:
pd.merge(left,right,on = 'key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## 6.3  Append
Append rows to a dataframe. See the Appending


Append 将一行连接到一个DataFrame上，具体请参阅Appending：

In [95]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [96]:
df

          A         B         C         D
0  0.660187 -1.041719  0.067099 -0.487879
1 -2.122553 -0.079789  0.342163  0.662272
2 -0.069082  0.318335  0.020795  0.648720
3  0.121743 -1.451176 -0.284299 -1.310808
4 -0.866064  0.224399  1.884600 -0.749573
5 -0.188017  0.514920 -1.863785  1.262319
6 -1.635640  0.512882 -0.825465 -0.824140
7 -0.909720 -0.799141  0.440115 -0.202843

In [97]:
s = df.iloc[3]

In [98]:
s

A    0.121743
B   -1.451176
C   -0.284299
D   -1.310808
Name: 3, dtype: float64

In [99]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.660187 -1.041719  0.067099 -0.487879
1 -2.122553 -0.079789  0.342163  0.662272
2 -0.069082  0.318335  0.020795  0.648720
3  0.121743 -1.451176 -0.284299 -1.310808
4 -0.866064  0.224399  1.884600 -0.749573
5 -0.188017  0.514920 -1.863785  1.262319
6 -1.635640  0.512882 -0.825465 -0.824140
7 -0.909720 -0.799141  0.440115 -0.202843
8  0.121743 -1.451176 -0.284299 -1.310808

# 7 Grouping  分组

By “group by” we are referring to a process involving one or more of the following steps

Splitting the data into groups based on some criteria

Applying a function to each group independently

Combining the results into a data structure

See the Grouping section


对于”group by”操作，我们通常是指以下一个或多个操作步骤：

l  （Splitting）按照一些规则将数据分为不同的组；

l  （Applying）对于每组数据分别执行一个函数；

l  （Combining）将结果组合到一个数据结构中；

详情请参阅：Grouping section

In [100]:
 df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                 'D' : np.random.randn(8)})

In [101]:
df

     A      B         C         D
0  foo    one -0.423324 -0.367272
1  bar    one -0.544345  1.097740
2  foo    two -0.299857  0.754868
3  bar  three -0.240641 -1.017222
4  foo    two  1.091172  0.936721
5  bar    two  1.311341 -0.683813
6  foo    one  1.237424 -0.704050
7  foo  three -0.519409  0.663339

In [102]:
df.groupby('A').agg('mean')

            C         D
A
bar  0.175452 -0.201099
foo  0.217201  0.256721

In [103]:
df.groupby(['A','B']).agg('sum')

                  C         D
A   B
bar one   -0.544345  1.097740
    three -0.240641 -1.017222
    two    1.311341 -0.683813
foo one    0.814100 -1.071322
    three -0.519409  0.663339
    two    0.791315  1.691589

# 8 Reshaping

See the sections on Hierarchical Indexing and Reshaping.


详情请参阅 Hierarchical Indexing 和 Reshaping。

## 8.1 Stack

In [104]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                    'foo', 'foo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two',
                    'one', 'two', 'one', 'two']]))

In [105]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [106]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [107]:
df

                     A         B
first second
bar   one     0.940159  1.279596
      two     0.449382 -1.344563
baz   one    -0.551233  0.051240
      two     1.336763  0.420522
foo   one    -0.459486 -1.302671
      two     1.129206 -0.512587
qux   one     1.368496 -1.076578
      two     0.390557  1.784025

In [108]:
df2 = df[:4]

In [109]:
df2

                     A         B
first second
bar   one     0.940159  1.279596
      two     0.449382 -1.344563
baz   one    -0.551233  0.051240
      two     1.336763  0.420522

In [110]:
stacked = df2.stack()

In [111]:
stacked

first  second
bar    one     A    0.940159
               B    1.279596
       two     A    0.449382
               B   -1.344563
baz    one     A   -0.551233
               B    0.051240
       two     A    1.336763
               B    0.420522
dtype: float64

In [112]:
stacked.unstack()

                     A         B
first second
bar   one     0.940159  1.279596
      two     0.449382 -1.344563
baz   one    -0.551233  0.051240
      two     1.336763  0.420522

In [113]:
stacked.unstack(1)

second        one       two
first
bar   A  0.940159  0.449382
      B  1.279596 -1.344563
baz   A -0.551233  1.336763
      B  0.051240  0.420522

In [114]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.940159 -0.551233
       B  1.279596  0.051240
two    A  0.449382  1.336763
       B -1.344563  0.420522

## 8.2 Pivot Tables（数据透视表）

In [115]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [116]:
df

        A  B    C         D         E
0     one  A  foo -0.586593  0.193193
1     one  B  foo  0.319903 -0.467265
2     two  C  foo -2.241534 -1.873129
3   three  A  bar  1.514271  1.867764
4     one  B  bar  0.910805 -0.380422
5     one  C  bar  0.819878 -0.081463
6     two  A  foo  0.057769 -0.737145
7   three  B  foo -0.639165  0.837447
8     one  C  foo -0.855231 -0.610881
9     one  A  bar -0.433182 -0.085853
10    two  B  bar  0.497053  0.198303
11  three  C  bar -1.398815  0.858663

In [117]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.433182 -0.586593
      B  0.910805  0.319903
      C  0.819878 -0.855231
three A  1.514271       NaN
      B       NaN -0.639165
      C -1.398815       NaN
two   A       NaN  0.057769
      B  0.497053       NaN
      C       NaN -2.241534

# 9 Time Series时间序列

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the Time Series section



Pandas在对频率转换进行重新采样时拥有简单、强大且高效的功能（如将按秒采样的数据转换为按5分钟为单位进行采样的数据）。这种操作在金融领域非常常见。具体参考：Time Series section。

In [118]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [119]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [120]:
ts.head()

2012-01-01 00:00:00     87
2012-01-01 00:00:01    418
2012-01-01 00:00:02     24
2012-01-01 00:00:03     14
2012-01-01 00:00:04     38
Freq: S, dtype: int64

Time zone representation

 时区表示：

In [121]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [122]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [123]:
ts

2012-03-06    0.137363
2012-03-07    0.074664
2012-03-08    1.000281
2012-03-09   -0.213419
2012-03-10   -0.387297
Freq: D, dtype: float64

In [124]:
ts_utc = ts.tz_localize('UTC')

In [125]:
ts_utc

2012-03-06 00:00:00+00:00    0.137363
2012-03-07 00:00:00+00:00    0.074664
2012-03-08 00:00:00+00:00    1.000281
2012-03-09 00:00:00+00:00   -0.213419
2012-03-10 00:00:00+00:00   -0.387297
Freq: D, dtype: float64

Convert to another time zone

时区转换：

In [126]:
 ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.137363
2012-03-06 19:00:00-05:00    0.074664
2012-03-07 19:00:00-05:00    1.000281
2012-03-08 19:00:00-05:00   -0.213419
2012-03-09 19:00:00-05:00   -0.387297
Freq: D, dtype: float64

Converting between time span representations

时间跨度转换：

In [127]:
 rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [128]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [129]:
ts

2012-01-31    1.240325
2012-02-29    0.844450
2012-03-31    0.354598
2012-04-30    0.346415
2012-05-31    1.706306
Freq: M, dtype: float64

In [130]:
 ps = ts.to_period()

In [131]:
ps

2012-01    1.240325
2012-02    0.844450
2012-03    0.354598
2012-04    0.346415
2012-05    1.706306
Freq: M, dtype: float64

In [132]:
ps.to_timestamp()

2012-01-01    1.240325
2012-02-01    0.844450
2012-03-01    0.354598
2012-04-01    0.346415
2012-05-01    1.706306
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:
    
时期和时间戳之间的转换使得可以使用一些方便的算术函数。

# 10.Categoricals(种类数据)

从0.15版本开始，pandas可以在DataFrame中支持Categorical类型的数据，详细 介绍参看：categorical introduction和API documentation。

In [133]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

Convert the raw grades to a categorical data type.

将原始的grade转换为Categorical数据类型：

In [134]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [135]:
df["grade"] = df["raw_grade"].astype("category")

In [136]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [137]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [138]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [139]:
df.sort_values(by="grade",ascending=False)

   id raw_grade      grade
5   6         e   very bad
2   3         b       good
1   2         b       good
4   5         a  very good
3   4         a  very good
0   1         a  very good

In [140]:
df.groupby("grade").size()

grade
very good    3
good         2
very bad     1
dtype: int64

# 11.Plotting 画图

# 12.Getting Data In/Out 数据输入输出

##  12.1 CSV

In [141]:
df.to_csv('foo.csv')

In [142]:
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

## 12.2 HDF5

## 12.3 EXCEL

In [143]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [144]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad